app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "catchafish@sojuicysweet.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email_address: user_login_params[:email_address])