app/controllers/api/v1/intersectionality_models_controller.rb

SELECT "intersectionality_models".* FROM "intersectionality_models"
---
  def index
    @intersectionality_models = IntersectionalityModel.all