app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email_address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.create(user_params)

INSERT INTO "users" ("first_name", "last_name", "email_address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def update
    @user.update(user_params)
    if @user.save